app/controllers/prescriptions_controller.rb

  def index
    @prescriptions = Prescription.all
---
SELECT `prescriptions`.* FROM `prescriptions`

  def show
    @prescription = Prescription.find(params[:id])
---
SELECT `prescriptions`.* FROM `prescriptions` WHERE `prescriptions`.`id` = 1 LIMIT 1

  def edit
    @prescription = Prescription.find(params[:id])
---
SELECT `prescriptions`.* FROM `prescriptions` WHERE `prescriptions`.`id` = 3 LIMIT 1

  def create
    @prescription = Prescription.new(params[:prescription])

    respond_to do |format|
      if @prescription.save
---
INSERT INTO `prescriptions` (`created_at`, `ingredients`, `name`, `updated_at`) VALUES ('2013-04-15 15:37:43', 'Farinha, Manteiga', 'Bolo', '2013-04-15 15:37:43')

  def update
    @prescription = Prescription.find(params[:id])

    respond_to do |format|
      if @prescription.update_attributes(params[:prescription])
---
SELECT `prescriptions`.* FROM `prescriptions` WHERE `prescriptions`.`id` = 3 LIMIT 1
UPDATE `prescriptions` SET `name` = 'Teste 1', `ingredients` = 'Teste 1', `updated_at` = '2013-04-16 12:53:21' WHERE `prescriptions`.`id` = 4